---
title: CableTrayConduitBase
classe: Autodesk.Revit.DB.Electrical.CableTrayConduitBase
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.MEPCurve
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# CableTrayConduitBase

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId RunId { get; }` | `cableTrayConduitBase.RunId` | ElementId |
| `Boolean IsValidEndPoints(XYZ, XYZ)` | `CableTrayConduitBase.IsValidEndPoints(startPoint, endPoint)` | Boolean |
| `Boolean IsValidLevelId(Document, ElementId)` | `CableTrayConduitBase.IsValidLevelId(document, levelId)` | Boolean |
| `Boolean IsWithFitting()` | `cableTrayConduitBase.IsWithFitting()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```